#  三大结构 ： 线  树  图
    # 线性的
        # 一对一的 线 性 关系
            # 栈 和 队列 是具有特殊限制的 线性表
                # 数据操作 只能在表的一端 或两端 进行
            # 字符串 也是特殊的线性表
                # 特殊在 他的数据元素 只由 一个 字符组成
            # 线性表的推广
                # 数组
                # 广义表
    # 非线性的
        # 集合结构 除了 在同一个集合 以外，没别的关系
        # 一对多的 树 状 关系
            # 树 和 二叉树
        # 多对多的 图结构
            # 有向图
                # 边 是 顶点的 有序对
            # 无向图
                # 边 是 顶点的 无序对
        # 多对多的 网状结构

# 数据的存储结构
    # 顺序存储
        # 线性表的 顺序存储  叫做 顺序表
            # 特点是 逻辑上相邻的 元素 在 物理的次序上也是相邻的
            # 线性表的 顺序存储结构 是一种 随机存取的 存储结构
    # 链式存储


